a = 5
b = a + (5 * b)
say a + b
pull c
say c
if a < b then
do
say c
end
if a == c & b == a then
do
say b
end
else do
say a
end
do i = 1 to 10 
say i
end

